TexasInstruments/azure-iot-pal-simplelink/sample/CC3235SF_LAUNCHXL/CC3235SF_LAUNCHXL.c
/*
 *  =============================== General ===============================
 */
/*
 *  ======== CC3235SF_LAUNCHXL_initGeneral ========
 */
void CC3235SF_LAUNCHXL_initGeneral(void)
{
    PRCMCC3200MCUInit();
    Power_init();
}

/*
 *  =============================== GPIO ===============================
 */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOCC32XX.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC3235SF_LAUNCHXL.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array.  Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* input pins with callbacks */
    /* CC3235SF_LAUNCHXL_GPIO_SW2 */
    GPIOCC32XX_GPIO_13 | GPIO_CFG_INPUT | GPIO_CFG_IN_INT_RISING,
    /* CC3235SF_LAUNCHXL_GPIO_SW3 */
    GPIOCC32XX_GPIO_22 | GPIO_CFG_INPUT | GPIO_CFG_IN_INT_RISING,

    /* CC3235SF_LAUNCHXL_SPI_MASTER_READY */
    GPIOCC32XX_GPIO_28 | GPIO_DO_NOT_CONFIG,
    /* CC3235SF_LAUNCHXL_SPI_SLAVE_READY */
    GPIOCC32XX_GPIO_12 | GPIO_DO_NOT_CONFIG,

    /* output pins */
    /* CC3235SF_LAUNCHXL_GPIO_LED_BLUE */
    GPIOCC32XX_GPIO_09 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_STR_HIGH | GPIO_CFG_OUT_LOW,

    /*
     *  CC3235SF_LAUNCHXL_GPIO_LED_RED and CC3235SF_LAUNCHXL_GPIO_LED_GREEN are shared with the
     *  I2C and PWM peripherals. In order for those examples to work, these
     *  LEDs are taken out of gpioPinConfig[]
     */
    /* CC3235SF_LAUNCHXL_GPIO_LED_RED */
    /* GPIOCC32XX_GPIO_10 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_STR_HIGH | GPIO_CFG_OUT_LOW, */
    /* CC3235SF_LAUNCHXL_GPIO_LED_GREEN */
    /* GPIOCC32XX_GPIO_11 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_STR_HIGH | GPIO_CFG_OUT_LOW, */

    /* Sharp Display - GPIO configurations will be done in the Display files */
    GPIOCC32XX_GPIO_12 | GPIO_DO_NOT_CONFIG, /* SPI chip select */
    GPIOCC32XX_GPIO_06 | GPIO_DO_NOT_CONFIG, /* LCD power control */
    GPIOCC32XX_GPIO_03 | GPIO_DO_NOT_CONFIG, /*LCD enable */
};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC3235SF_LAUNCHXL.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    NULL,  /* CC3235SF_LAUNCHXL_GPIO_SW2 */
    NULL,  /* CC3235SF_LAUNCHXL_GPIO_SW3 */
    NULL,  /* CC3235SF_LAUNCHXL_SPI_MASTER_READY */
    NULL   /* CC3235SF_LAUNCHXL_SPI_SLAVE_READY */
};

/* The device-specific GPIO_config structure */
const GPIOCC32XX_Config GPIOCC32XX_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = (~0)
};

/*
 *  ============================= Display =============================
 */
#include <ti/display/Display.h>
#include <ti/display/DisplayUart.h>
#include <ti/display/DisplaySharp.h>
#define MAXPRINTLEN 1024

/* This value can be changed to 96 for use with the 430BOOST-SHARP96 BoosterPack. */
#define BOARD_DISPLAY_SHARP_SIZE    128

DisplayUart_Object displayUartObject;
DisplaySharp_Object displaySharpObject;

static char displayBuf[MAXPRINTLEN];
static uint_least8_t sharpDisplayBuf[BOARD_DISPLAY_SHARP_SIZE * BOARD_DISPLAY_SHARP_SIZE / 8];

const DisplayUart_HWAttrs displayUartHWAttrs = {
    .uartIdx = 0,
    .baudRate = 115200,
    .mutexTimeout = (unsigned int)(-1),
    .strBuf = displayBuf,
    .strBufLen = MAXPRINTLEN
};

const DisplaySharp_HWAttrsV1 displaySharpHWattrs = {
    .spiIndex    = CC3235SF_LAUNCHXL_SPI1,
    .csPin       = CC3235SF_LAUNCHXL_LCD_CS,
    .powerPin    = CC3235SF_LAUNCHXL_LCD_POWER,
    .enablePin   = CC3235SF_LAUNCHXL_LCD_ENABLE,
    .pixelWidth  = BOARD_DISPLAY_SHARP_SIZE,
    .pixelHeight = BOARD_DISPLAY_SHARP_SIZE,
    .displayBuf  = sharpDisplayBuf,
};

#ifndef BOARD_DISPLAY_USE_UART
#define BOARD_DISPLAY_USE_UART 1
#endif
#ifndef BOARD_DISPLAY_USE_UART_ANSI
#define BOARD_DISPLAY_USE_UART_ANSI 0
#endif
#ifndef BOARD_DISPLAY_USE_LCD
#define BOARD_DISPLAY_USE_LCD 0
#endif

const Display_Config Display_config[] = {
    {
#  if (BOARD_DISPLAY_USE_UART_ANSI)
        .fxnTablePtr = &DisplayUartAnsi_fxnTable,
#  else /* Default to minimal UART with no cursor placement */
        .fxnTablePtr = &DisplayUartMin_fxnTable,
#  endif
        .object = &displayUartObject,
        .hwAttrs = &displayUartHWAttrs
    },
#if (BOARD_DISPLAY_USE_LCD)
    {
        .fxnTablePtr = &DisplaySharp_fxnTable,
        .object      = &displaySharpObject,
        .hwAttrs     = &displaySharpHWattrs
    },
#endif
};

const uint_least8_t Display_count = sizeof(Display_config) / sizeof(Display_Config);



/*
 *  =============================== I2C ===============================
 */
#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CCC32XX.h>

I2CCC32XX_Object i2cCC3235SObjects[CC3235SF_LAUNCHXL_I2CCOUNT];

const I2CCC32XX_HWAttrsV1 i2cCC3235SHWAttrs[CC3235SF_LAUNCHXL_I2CCOUNT] = {
    {
        .baseAddr = I2CA0_BASE,
        .intNum = INT_I2CA0,
        .intPriority = (~0),
        .clkPin = I2CCC32XX_PIN_01_I2C_SCL,
        .dataPin = I2CCC32XX_PIN_02_I2C_SDA
    }
};

const I2C_Config I2C_config[CC3235SF_LAUNCHXL_I2CCOUNT] = {
    {
        .fxnTablePtr = &I2CCC32XX_fxnTable,
        .object = &i2cCC3235SObjects[CC3235SF_LAUNCHXL_I2C0],
        .hwAttrs = &i2cCC3235SHWAttrs[CC3235SF_LAUNCHXL_I2C0]
    }
};

const uint_least8_t I2C_count = CC3235SF_LAUNCHXL_I2CCOUNT;

/*
 *  =============================== I2S ===============================
 */
#include <ti/drivers/I2S.h>
#include <ti/drivers/i2s/I2SCC32XXDMA.h>

I2SCC32XXDMA_Object i2sCC3235SObjects[CC3235SF_LAUNCHXL_I2SCOUNT];

const I2SCC32XXDMA_HWAttrsV1 i2sCC3235SHWAttrs[CC3235SF_LAUNCHXL_I2SCOUNT] = {
    {
        .baseAddr = I2S_BASE,
        .intNum = INT_I2S,
        .intPriority = (~0),
        .rxChannelIndex = UDMA_CH4_I2S_RX,
        .txChannelIndex = UDMA_CH5_I2S_TX,
        .xr0Pin = I2SCC32XXDMA_PIN_64_McAXR0,
        .xr1Pin = I2SCC32XXDMA_PIN_50_McAXR1,
        .clkxPin = I2SCC32XXDMA_PIN_62_McACLKX,
        .clkPin = I2SCC32XXDMA_PIN_53_McACLK,
        .fsxPin = I2SCC32XXDMA_PIN_63_McAFSX,
    }
};

const I2S_Config I2S_config[CC3235SF_LAUNCHXL_I2SCOUNT] = {
    {
        .fxnTablePtr = &I2SCC32XXDMA_fxnTable,
        .object = &i2sCC3235SObjects[CC3235SF_LAUNCHXL_I2S0],
        .hwAttrs = &i2sCC3235SHWAttrs[CC3235SF_LAUNCHXL_I2S0]
    }
};

const uint_least8_t I2S_count = CC3235SF_LAUNCHXL_I2SCOUNT;

